# BUSA 603 Lab1: Data Exploration

## Outcomes

1. Explain Pandas Series and Dataframe.
2. Inspect and explore data.

## Python Pandas

**Pandas** is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

![title](https://github.com/franklin-univ-data-science/data/blob/master/images/data_clean.png?raw=true)

### Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in marketing analytics.

## Pandas as pd
Pandas is usually imported under the **pd** alias.

In [2]:
import pandas as pd

## Pandas Series 

A Pandas Series is like a column in a table.

It is a list holding data of any type.

In [3]:
# Create a simple Pandas Series from a list:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a)

myvar

0    1
1    7
2    2
dtype: int64

### Labels
If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

This label can be used to access a specified value.

In [4]:
# Return the first value of the Series:
myvar[0]

1

### Create Labels
With the `index` argument, you can name your own labels.

In [5]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

myvar

x    1
y    7
z    2
dtype: int64

When you have created labels, you can access an item by referring to the label.

In [5]:
myvar["y"]

## Pandas DataFrames

A Pandas DataFrame is a 2 dimensional data structure, like a table with rows and columns.

In the following code, data is a Python dictionary. Dictionaries are used to store data values in **key:value** pairs.

In [6]:
# Create a simple Pandas DataFrame:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

df

### Select One or Multiple Columns

In [7]:
df['calories']

In [8]:
df[['calories', 'duration']]

   calories  duration
0       420        50
1       380        40
2       390        45

### Locate Row
As you can see from the result above, the DataFrame is like a table with rows and columns.

Pandas use the loc attribute to return one or more specified row(s)

In [9]:
# return row 0
# refer to the row index:
df.loc[0]

calories    420
duration     50
Name: 0, dtype: int64

In [10]:
# Return row 0 and 1:
# use a list of indexes:
df.loc[[0, 1]]

### Named Indexes
With the index argument, you can name your own indexes.

In [11]:
# Add a list of names to give each row a name:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

df

### Locate Named Indexes
Use the named index in the loc attribute to return the specified row(s).

In [12]:
#Return "day2":
#refer to the named index:
df.loc["day2"]

### Locate and Slice Data Using Both Name Index and Column Name.

Use the named index and column name in the loc attribute to return the specified cell.

In [13]:
df.loc["day2", "duration"]

The `loc` is also very powerful to slice data. Its first parameter defines the row(s), and the second parameter specifies the column(s).

For example, to get the duration when calories are less than 400:

In [14]:
df.loc[df["calories"] < 400, "duration"]

## Data Exploration

Once the raw data are extracted from the database or other data sources, we usually review and inspect the data set to assess data quality and relevant information for subsequent analysis.

### Load CSV Files into a DataFrame

In [15]:
df = pd.read_csv('mpg.csv')

### View the Data by `head()` Function

In [16]:
# the top five rows
df.head()

In [17]:
# the top 10 rows
df.head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
5,15.0,8,429.0,198,4341,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220,4354,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8,390.0,190,3850,8.5,70,1,amc ambassador dpl

### Check the Data Size: counts of rows and columns

In [18]:
# 398 rows and 9 columns
df.shape

### Check Column Names

In [19]:
list(df)

### Check Missing Values

The `isna()` returns the True or False of missing value for each item in the column. In computer science, True is 1 and False is 0. Thus, the `sum()` function after `is.na()` returns the count of missing values by column.  

Note that in Python, you can call multiple functions connected by the period symbol. For example, in the following code cell, first `isna()` is called, then `sum()` is called. This method is handy to check the missing values.

In [20]:
df.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

### Check Data type by Column

In [21]:
df.dtypes # list data type, note that string is a object

### Select Row and Columns Based on the Given Conditions

- `&` is used as the "AND" logic.
- `|` is used as the "OR" logic.

In [22]:
mpg_15 = df[(df["mpg"] == 15) & (df["model_year"] == 72)]
mpg_15

In [23]:
mpg_15_cyl_6 = df[(df['mpg'] == 15) | (df["cylinders"] == 6)]
mpg_15_cyl_6

Select both row and column using `loc`:

In [24]:
df.loc[(df.mpg == 15) | (df.mpg == 16), ['name', 'model_year']]

                                  name  model_year
1                    buick skylark 320          70
3                        amc rebel sst          70
5                     ford galaxie 500          70
9                   amc ambassador dpl          70
10                 dodge challenger se          70
12               chevrolet monte carlo          70
34           plymouth satellite custom          71
64                   plymouth fury iii          72
72                    amc matador (sw)          72
89                dodge coronet custom          73
98               chevrolet nova custom          73
115            chevrolet monte carlo s          73
116                 pontiac grand prix          73
121                  dodge dart custom          73
128                     chevrolet nova          74
133  chevrolet chevelle malibu classic          74
134                        amc matador          74
136                   ford gran torino          74
154                    mercury monarch          75
155                      ford maverick          75
156                   pontiac catalina          75
157                  chevrolet bel air          75
158                plymouth grand fury          75
161          chevroelt chevelle malibu          75
162                        amc matador          75
188             dodge coronet brougham          76
224            mercury cougar brougham          77
229              pontiac grand prix lj          77
232                   ford thunderbird          77

### Value Count

The `value_count()` function returns the counts of unique values. The restuls are in descending order so that the first element is the most frequently-occurring element.

In [25]:
#The count by vehicle's "name".
veh_count = df.name.value_counts()
veh_count

### Sort

The `sort_values()` function sorts dataframe by the values.

To sort in descending order, you need to set `ascending=False` as by default ascending=True.

In [26]:
# sort by "model year" and "cylinders"
year_cyl = df.sort_values(by=['model_year', 'cylinders'], ascending=False)
year_cyl

### Check Outliers by Boxplot

![title](https://raw.githubusercontent.com/franklin-univ-data-science/data/master/images/boxplot.png)

In [27]:
df.boxplot(column=['weight'])

### Fill Missing Values

In [28]:
# create some miss values
df_mis = df.copy()
df_mis.loc[1, "weight"] = None
df_mis.loc[2, "weight"] = None
df_mis.loc[3, "weight"] = None
df_mis.head()

In [29]:
# Fill the missing values with mean
df_mis['weight'] = df_mis['weight'].fillna(df_mis['weight'].mean())
df_mis.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504.00000,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,2966.24557,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,2966.24557,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,2966.24557,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449.00000,10.5,70,1,ford torino

### Check Distribution

In [30]:
# what is the distribuation of mpg?
df["mpg"].hist()

## Additional Learning (Optional)

### Data Wrangling
Based on what has been introduced above, you can further learn the data wrangling.

Data wrangling is the process of retrieving, cleaning, integrating, transforming, and enriching data to support analytics. It is often considered one of the most critical and time-consuming steps in an analytics project. 

Besides data exploration, some other essential data-wrangling topics include merging data sets, treating missing values, and aggregating data. Please refer to the Chapter 1 and 2 in the following optional textbook for more details:
[Data Science for Marketing Analytics](https://learning.oreilly.com/library/view/data-science-for/9781789959413/)


### Install Python locally
There are many ways to install Python and its editor. The most convenient method is to install Anacanda: https://www.youtube.com/watch?v=y2TrNY4d0A4

Then, you can work on a local Jupyter Notebook, which is similar to this environment.

## Assignment - Explore the Demographics Data

The accompanying table shows a portion of data that shows an individual’s income (Income in $1,000s), age, sex (F = female, M = male), and marital status (Married; Y = yes, N = no).

In [31]:
# load the data
import pandas as pd

df = pd.read_csv("Demographics.csv")
df.head()

   Individual  Income  Age Sex Married
0         272   147.0   55   M       Y
1         364   140.0   52   M       Y
2         514   140.0   54   M       N
3         476   138.0   56   F       Y
4         641   130.0   45   M       N

Action Items:
- Count the number of rows and columns 
    - hint: ref the Cell [18]
- What variable(s) have the missing values? 
    - hint: ref the Cell [20] 
- Count the number of males and females in the data uisng `value_counts()`. 
    - hint: ref the Cell [25]
- sort the data by Income and Age. 
    - hint: ref the Cell [26] 
- Of the 10 individuals with the highest income, select the married males. 
hint: 
    - Sort the data to get 10 individuals with the highest income. (ref the Cell [26])
    - Save the data to a new dataframe.The code would be something like df_top10 = df.sort_values(...).head(...)
    - Select the rows by married males. (ref the Cell [22])
- Fill the missing values with mean.
    - Ref the Cell [29]

In [32]:
# Enter you code here; click "+Code" to add new Code cell